/* eslint-disable no-unused-vars */
import Tab from "./components/TabView";
import Scroll from "./components/ScrollView";
import Text from "./components/Text";
import ListView from "./components/ListView";

import { createComponent } from "./utils/createComponent";

function loadMore(a) {
  console.log("loadmore：", a);
}

window.render = (body, data) => {
  const tab = (
    <Tab>
      <Scroll
        title="推荐"
        style="background-color:green"
        onScrollBottom={loadMore}
      >
        <ListView data={data}></ListView>
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
        推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐推荐
      </Scroll>
      <Scroll title="有趣的店" style="background-color:blue">
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
        有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店有趣的店
      </Scroll>
      <Scroll title="品牌新店" style="background-color:yellow"></Scroll>
    </Tab>
  );

  tab.appendTo(document.getElementById("app"));
};
